Revit 2027 API
IndependentTag.CanLeaderEndConditionBeAssigned Method
 Checks whether the LeaderEndCondition can be changed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanLeaderEndConditionBeAssigned(
	LeaderEndCondition leaderEndCondition
)
Public Function CanLeaderEndConditionBeAssigned (
	leaderEndCondition As LeaderEndCondition
) As Boolean
public:
bool CanLeaderEndConditionBeAssigned(
	LeaderEndCondition leaderEndCondition
)
member CanLeaderEndConditionBeAssigned :
        leaderEndCondition : LeaderEndCondition -> bool
Parameters
leaderEndCondition LeaderEndCondition
 The LeaderEndCondition that will be checked to see if it can be assigned.
Return Value
Boolean
 True if the LeaderEndCondition of the tag can be assigned, or false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Material tags and material keynotes can only use the free end condition.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace